app/Views/front-end/v_sejarah.php

SELECT *
FROM `tbl_setting`
---
<?php
$db = \Config\Database::connect();
$web = $db->table('tbl_setting')->get()->getRowArray();