app/Models/ModelProfile.php

    public function getDataSejarah()
    {
        return $this->db->table('tbl_sejarah')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_sejarah`

    public function getDataVisiMisi()
    {
        return $this->db->table($this->tableVisiMisi)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_visimisi`

    public function getDataOrganisasi()
    {
        return $this->db->table($this->tableOrganisasi)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_organisasi`

    public function getDataSarana()
    {
        return $this->db->table($this->tableSarana)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_sarana`