app/Models/ModelLogin.php

SELECT *
FROM `tbl_user`
WHERE `username` = 'admin'
AND `password` = '123'
---
    public function CekUser($username, $password)
    {
        return $this->db->table('tbl_user')
            ->where('username', $username)
            ->where('password', $password)
            ->get()->getRowArray();