app/Models/ModelKontak.php

    public function getKontak()
    {
        return $this->db->table('tbl_kontak')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kontak`