app/Models/ModelUsers.php

    public function DataUsers()
    {
        return $this->db->table('tbl_user')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_user`