app/Models/ModelAdmin.php

    public function ViewSetting()
    {
        return $this->db->table('tbl_setting')
            ->where('id', 1)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`
WHERE `id` = 1