app/Models/ModelAgenda.php

    public function AllData()
    {
        return $this->db->table('tbl_agenda')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_agenda`